app/views/clientes/show.html.erb

      <tbody>
      <% @cliente.contas.each do |conta| %>
---
SELECT "contas".* FROM "contas" WHERE "contas"."cliente_id" = $1  [["cliente_id", 1]]