app/controllers/application_controller.rb

  def valida_classes_metodos
    if (action_name == 'new' || action_name == 'edit' || action_name == 'create' || action_name == 'update' || action_name == 'destroy')
      case controller_name
      when 'transferencias'
        if params[:tipo] == 'transferência' || params[:tipo] == 'saque'
          cliente = Cliente.find(Conta.find(params[:cliente_id]).cliente_id)
        else
          cliente = Cliente.find(session[:usuario_id])
        end
      when 'contas'
        cliente = Cliente.find(Conta.find(params[:id]).cliente_id)
      else
        cliente = Cliente.find(params[:id])
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "contas".* FROM "contas" WHERE "contas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "contas".* FROM "contas" WHERE "contas"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]