app/controllers/clientes_controller.rb

  def create
    @cliente = Cliente.new(cliente_params)
    @cliente.password = Digest::MD5.hexdigest(@cliente.password)
    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("nome", "email", "cpf", "rg", "endereco", "data_nascimento", "created_at", "updated_at", "password") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @cliente.update(cliente_params)
---
UPDATE "clientes" SET "cpf" = $1, "updated_at" = $2 WHERE "clientes"."id" = $3  [["cpf", "00377722133"], ["updated_at", "2020-11-01 19:09:45.396414"], ["id", 1]]

  def extrato
    @conta = Conta.find(params[:cliente_id])
    @cliente = Cliente.find(@conta.cliente_id)
    cond = []
    if params[:data]
      cond << "created_at >= '#{params[:data][:inicio]}'" unless params[:data][:inicio].blank?
      cond << "created_at <= '#{params[:data][:fim]}'" unless params[:data][:fim].blank?
    end
    cond << "cliente_id = #{@conta.id}" unless @conta.nil?
    @transferencias = Transferencia.where(cond.join(' AND '))
---
SELECT "contas".* FROM "contas" WHERE "contas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "contas".* FROM "contas" WHERE "contas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "transferencias".* FROM "transferencias" WHERE (created_at >= '2020-10-01' AND created_at =< '2020-11-30' AND cliente_id = 2)