app/controllers/contas_controller.rb

SELECT "contas".* FROM "contas"
---
  def index
    @conta = Conta.all

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @conta = Conta.new
    @cliente = Cliente.find(params[:cliente_id])

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "contas" ("numero", "saldo", "data_abertura", "tipo", "data_encerramento", "created_at", "updated_at", "cliente_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @conta = Conta.new(conta_params)
    @cliente = Cliente.find(@conta.cliente_id)
    respond_to do |format|
      if @conta.save

UPDATE "contas" SET "saldo" = $1, "tipo" = $2, "data_encerramento" = $3, "updated_at" = $4 WHERE "contas"."id" = $5  [["saldo", "4.971"], ["tipo", 0], ["data_encerramento", "2020-11-01"], ["updated_at", "2020-11-01 20:05:28.286013"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @conta.update(conta_params)

SELECT "contas".* FROM "contas" WHERE "contas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_conta
    @conta = Conta.find(params[:id])
    @cliente = Cliente.find(@conta.cliente_id)