app/controllers/transferencias_controller.rb

SELECT "contas".* FROM "contas" WHERE "contas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_conta_cliente(conta_id)
    @conta_autor = Conta.find(conta_id)
    @cliente_autor = Cliente.find(@conta_autor.cliente_id)

INSERT INTO "transferencias" ("cliente_id", "conta_id", "tipo", "valor", "created_at", "updated_at", "saldo_conta", "tarifa") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def salvar transferencia, cliente_autor
    respond_to do |format|
      if transferencia.save

SELECT "transferencias".* FROM "transferencias" WHERE "transferencias"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_transferencia
    @transferencia = Transferencia.find(params[:id])