app/models/cliente.rb

  def self.valida(login, pass)
    usu = Cliente.find_by_email(login)
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."email" = $1 LIMIT $2  [["email", "yuribrom@gmail.com"], ["LIMIT", 1]]