app/models/transferencia.rb

  def cobrar
    if self.valor && self.cliente_id && self.conta_id
      tarifa = tarifa_tranferencia
      total_cobrar = tarifa + self.valor
      autor = Conta.find(self.cliente_id)
      receptor = Conta.find(self.conta_id)
      self.saldo_conta = autor.saldo
      self.tarifa = tarifa
      case self.tipo
      when 'deposito'
        receptor.saldo = receptor.saldo + self.valor
      when 'saque'
        if (autor.saldo < self.valor)
          self.errors.add(:base, "Essa operação não pode ser realizada!")
        else
          autor.saldo = autor.saldo - self.valor
        end
      else
        if (autor.saldo < total_cobrar)
          self.errors.add(:base, "Essa operação não pode ser realizada!")
        else
          autor.saldo = autor.saldo - total_cobrar
          receptor.saldo = receptor.saldo + self.valor
        end
      end
      receptor.save!
      autor.save!
---
SELECT "contas".* FROM "contas" WHERE "contas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "contas".* FROM "contas" WHERE "contas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "contas" SET "saldo" = $1, "updated_at" = $2 WHERE "contas"."id" = $3  [["saldo", "4050.0"], ["updated_at", "2020-11-09 10:16:40.497672"], ["id", 2]]
UPDATE "contas" SET "saldo" = $1, "updated_at" = $2 WHERE "contas"."id" = $3  [["saldo", "2945.0"], ["updated_at", "2020-11-09 10:16:40.501429"], ["id", 1]]

  def self.valida_transferencia(login, pass)
    usu = Cliente.find_by_email(login)
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."email" = $1 LIMIT $2  [["email", "yuribrom@gmail.com"], ["LIMIT", 1]]